In [1]:
import pandas as pd

In [3]:
data = pd.read_csv("./data/employee_data.csv")
df = pd.DataFrame(data)
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

# DataFrame Method

In [8]:
print(df.head())      
# Shows the first 5 rows of the DataFrame (default = 5 rows)
# Useful to quickly inspect the top of the dataset

print(df.tail())      
# Shows the last 5 rows of the DataFrame
# Helpful to check how the dataset ends

print(df.isnull())    
# Returns a DataFrame of True/False values
# True means the value is missing (NaN), False means value is present

print(df.describe())  
# Gives statistical summary of numerical columns
# Includes count, mean, std, min, 25%, 50%, 75%, max

print(df.columns)     
# Displays the column names of the DataFrame

print(df.info())      
# Provides summary information:
# - Number of entries
# - Column names
# - Data types
# - Non-null counts
# - Memory usage

print(df.sample())    
# Returns one random row from the DataFrame (default = 1 row)
# Useful for random inspection of data

print(df.nunique())   
# Shows the number of unique values in each column
# Helpful for understanding categorical features

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
   ID    Name  Age Department  Salary
5   6   Frank   29    Finance   50000
6   7   Grace   41         HR   82000
7   8  Hannah   26  Marketing   47000
8   9     Ian   35         IT   75000
9  10   Julia   30    Finance   60000
      ID   Name    Age  Department  Salary
0  False  False  False       False   False
1  False  False  False       False   False
2  False  False  False       False   False
3  False  False  False       False   False
4  False  False  False       False   False
5  False  False  False       False   False
6  False  False  False       False   False
7  False  False  False       False   False
8  False  False  False       False   False
9  False  False  False       False   False
             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000
Index(['ID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes
None
   ID   Name  Age Department  Salary
0   1  Alice   25         HR   55000
ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64

In [11]:
min_salary = df["Salary"].min()
print(min_salary)

47000